/*********************************************************************************************************
*  Copyright(c) 2012-2020     微嵌电子：淘宝店 http://Tonvdon.taobao.com
*
*  QQ: 30611966    旺旺：twd3621576   Email: tangweidong2004@163.com
* 
*  QQ群：C语言 深入应用交流(1)：168545343
*
*  QQ群：Cortex M0-M3-M4+Lwip+uip(1)：8753696
*
*  QQ群：Cortex+M0-M3-M4+Lwip+uip(2)：213952438
*
*  陆航MiniStm32 STM32F103VC/VET6 FSMC 总线开发板
*
* 硬件连接：
*===========================================文件信息=======================================================
* 文件名称:         
* 功    能:
*
* 编译软件：Keil MDK for ARM 4.12
* 当前版本: V5.0.0.0
* 作    者: Tonvdon(a dong)
* 完成日期: 2012-03-03
*
* 取代版本:
* 原作者  :
* 完成日期:
*********************************************************************************************************
*/
void GpioConfigurationLed(void);
