/***************************************************************************//**
  * @file    main.c
  * @author  吴国炎
  * @version V1.0.0
  * @date    2012年5月25号
  * @brief   主程序
  ******************************************************************************
  @verbatim
  主程序
  吴国炎制作
  技术博客网址：http://hi.baidu.com/wuguoyana/home
  @endverbatim
  * @attention
  *
  * 郑重声明：
  * 此文件只用于提供开发参考，如果因此文件而产生的任何问题纠纷，我概不负责。
  *
  * <h2><center> &copy; COPYRIGHT 2011 wuguoyana </center></h2>
*******************************************************************************/

/* 包含的头文件---------------------------------------------------------------*/
#include "stm32f0xx.h"
#include "main.h"

/* 私有类型定义---------------------------------------------------------------*/
/* 私有定义 ------------------------------------------------------------------*/
/* 私有宏定义 ----------------------------------------------------------------*/
/* 私有变量 ------------------------------------------------------------------*/
/* 私有函数 ------------------------------------------------------------------*/


/***************************************************************************//**
  * @brief  主函数，硬件初始化，实现LED1-LED4闪烁
  * @note   无
  * @param  无
  * @retval 无
*******************************************************************************/
int main(void)
{    
    DISCOVERY_Configuration(); //STM32 discovery Board configuration (clock etc..)    
    setup(); //Arduino configuration function
    loop();  //Arduino "main" loop functionnalities
	return(0);
}


#ifdef  USE_FULL_ASSERT
/***************************************************************************//**
  * @brief  报告在检查参数发生错误时的源文件名和错误行数
  * @param  file: 指向错误文件的源文件名
  * @param  line: 错误的源代码所在行数
  * @retval 无
*******************************************************************************/
void assert_failed(uint8_t* file, uint32_t line)
{
    /* 用户可以增加自己的代码用于报告错误的文件名和所在行数,
       例如：printf("错误参数值: 文件名 %s 在 %d行\r\n", file, line) */

    /* 死循环 */
    while (1)
    {
    }
}
#endif

/******************* (C) COPYRIGHT wuguoyana ***************文件结束***********/
