//=============================================================================
//文件名称：main.c
//功能概要：STM32F030F4核心板 LED基本操作
//版本更新：2014-01-04
//调试方式：J-Link OB ARM SWD ST-Link V2 SWD
//=============================================================================

//头文件
#include "stm32f0xx.h"
#include "LED.h"
//函数声明

//=============================================================================
//文件名称：Delay
//功能概要：延时函数
//参数说明：无
//函数返回：无
//=============================================================================
void  Delay (uint32_t nCount)
{
  for(; nCount != 0; nCount--);
}

//=============================================================================
//文件名称：main
//功能概要：主函数
//参数说明：无
//函数返回：int
//=============================================================================
int main(void)
{
  LED_Init();
  while(1)
  { 
  //Delay(0xfffff);
  //LED_ON;
  //Delay(0xfffff);
  //LED_OFF;
    Delay(0xfffff);
    LED_TURN;   //LED翻转
		
  }
}

/*****END OF FILE****/
