#include <stm32f10x_lib.h>	   
#include "led.h"
//////////////////////////////////////////////////////////////////////////////////	 
//±¾³ÌÐòÖ»¹©Ñ§Ï°Ê¹ÓÃ£¬Î´¾­×÷ÕßÐí¿É£¬²»µÃÓÃÓÚÆäËüÈÎºÎÓÃÍ¾
//Mini STM32¿ª·¢°å
//LEDÇý¶¯´úÂ											  
////////////////////////////////////////////////////////////////////////////////// 	   

//³õÊ¼»¯PA8ºÍPD2ÎªÊä³ö¿Ú.²¢Ê¹ÄÜÕâÁ½¸ö¿ÚµÄÊ±ÖÓ		    
//LED IO³õÊ¼»¯
void LED_Init(void)
{
	RCC->APB2ENR|=1<<2;    //Ê¹ÄÜPORTAÊ±ÖÓ	   	 
	RCC->APB2ENR|=1<<5;    //Ê¹ÄÜPORTDÊ±ÖÓ	
	   	 
	GPIOA->CRH&=0XFFFFFFF0; 
	GPIOA->CRH|=0X00000003;//PA8 ÍÆÍìÊä³ö   	 
    GPIOA->ODR|=1<<8;      //PA8 Êä³ö¸ß
											  
	GPIOD->CRL&=0XFFFFF0FF;
	GPIOD->CRL|=0X00000300;//PD.2ÍÆÍìÊä³ö
	GPIOD->ODR|=1<<2;      //PD.2Êä³ö¸ß 
}






