#ifndef __TIMER_H
#define __TIMER_H
#include "sys.h"
//////////////////////////////////////////////////////////////////////////////////	 
//±¾³ÌÐòÖ»¹©Ñ§Ï°Ê¹ÓÃ£¬Î´¾­×÷ÕßÐí¿É£¬²»µÃÓÃÓÚÆäËüÈÎºÎÓÃÍ¾
//Mini STM32¿ª·¢°å
//Í¨ÓÃ¶¨Ê±Æ÷ Çý¶¯´úÂ
////////////////////////////////////////////////////////////////////////////////// 	  

//Í¨¹ý¸Ä±äTIM3->CCR2µÄÖµÀ´¸Ä±äÕ¼¿Õ±È£¬´Ó¶ø¿ØÖÆLED0µÄÁÁ¶È
#define LED0_PWM_VAL TIM3->CCR2 

void Timerx_Init(u16 arr,u16 psc);
void PWM_Init(u16 arr,u16 psc);
#endif























